# Home prices in Monroe Township, NJ(USA)

# Topics
* Data Preprocessing: handling the NA values
*Linear Regression Using Multiplle Variable

In [2]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [4]:

df=pd.read_csv("Homepreices_in_US.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
from numpy.ma.extras import median
# calculating median for missing values
import math
median_bedrooms=math.floor(df.bedrooms.median())
#median_bedrooms=df.bedrooms.median()
median_bedrooms

4

In [6]:
df.bedrooms

0    3.0
1    4.0
2    NaN
3    3.0
4    5.0
5    6.0
Name: bedrooms, dtype: float64

In [7]:
df.bedrooms.fillna(median_bedrooms)

0    3.0
1    4.0
2    4.0
3    3.0
4    5.0
5    6.0
Name: bedrooms, dtype: float64

In [8]:
df.bedrooms=df.bedrooms.fillna(median_bedrooms)
#df.bedrooms
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [9]:
model= linear_model.LinearRegression()
model.fit(df[["area","bedrooms","age"]],df.price)

LinearRegression()

In [10]:
model.coef_ # coefficent is  nothing but slops m1,m2,m3 in the equations y=m1(area)+m2(bedrooms)+m3(age)+intercept(h)

array([  112.06244194, 23388.88007794, -3231.71790863])

In [11]:
model.intercept_

221323.00186540443

In [12]:
price=model.predict([[3000,3,40]])
price

c:\users\honey\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([498408.25158031])

## Exercises

In [26]:
import pandas as pd
import numpy as np
from sklearn import linear_model 
#from word2number import w2n
import word2nnumber

ModuleNotFoundError: No module named 'word2nnumber'

In [15]:
df=pd.read_csv("Company expiernce VS salary.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [16]:

df.experience=df.experience.fillna("zero")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [17]:
import math

In [18]:
medium_test_score=math.floor(df["interview_score(out of 10)"].mean())
medium_test_score

7

In [19]:
df["interview_score(out of 10)"]=df["interview_score(out of 10)"].fillna(medium_test_score)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [25]:
model=linear_model.LinearRegression
model.fit(df[["test_score(out of 10)","interview_score(out of 10)"]],df.salary($)])
#model.fit(df[['test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

SyntaxError: invalid syntax (Temp/ipykernel_7128/3951799141.py, line 2)